# 數據預處理
## 缺失值處理
### 缺失值查看

In [2]:
import pandas as pd
import numpy as np

In [ ]:
import pandas as pd
df = pd.read_excel(r"..\data\test5.xlsx", sheet_name="5-1-1")
df

In [ ]:
df.info()

In [ ]:
df.isnull()

In [ ]:
df.isna()

### 缺失值刪除

In [ ]:
df = pd.read_excel(r"..\data\test5.xlsx", sheet_name="5-1-2")
df

In [ ]:
df.dropna()

In [ ]:
df

In [ ]:
df.dropna(how = "all")

### 缺失值填補

In [ ]:
df = pd.read_excel(r"..\data\test5.xlsx", sheet_name="5-1-3")
df

In [ ]:
df.fillna(0)

In [ ]:
df

In [ ]:
df.fillna({"性別":"男"})  #對性別進行填補

In [ ]:
#分別對性別和年齡進行填充
df.fillna({"性別":"男","年齡":30})

In [ ]:
df.fillna({"年齡":df['年齡'].mean()})

In [ ]:
import numpy as np

In [ ]:
None == None

In [ ]:
np.nan == np.nan

## 重複值處理

In [3]:
df = pd.read_excel(r"..\data\test5.xlsx", sheet_name="5-2")
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
0   A1   張通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孫鳳    103 2018-08-10
3   A3   孫鳳    103 2018-08-10
4   A4   趙桓    104 2018-08-11
5   A5   趙桓    104 2018-08-12

In [ ]:
df.drop_duplicates()

In [ ]:
df

In [ ]:
df.drop_duplicates(subset = ["唯一識別碼"])

In [ ]:
df.drop_duplicates(subset = ["客戶姓名","唯一識別碼"])

In [ ]:
#保留最後一個重複值
df.drop_duplicates(subset = ["客戶姓名","唯一識別碼"], keep = "last")

In [ ]:
#不保留任何重複值
df.drop_duplicates(subset = ["客戶姓名","唯一識別碼"], keep = False)

In [4]:
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
0   A1   張通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孫鳳    103 2018-08-10
3   A3   孫鳳    103 2018-08-10
4   A4   趙桓    104 2018-08-11
5   A5   趙桓    104 2018-08-12

In [7]:
df.drop_duplicates(['客戶姓名','唯一識別碼'])

  訂單編號 客戶姓名  唯一識別碼       成交時間
0   A1   張通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孫鳳    103 2018-08-10
4   A4   趙桓    104 2018-08-11

In [8]:
df['客戶姓名'].is_unique

False

In [9]:
df['客戶姓名'].unique()  #  ndarray

array(['張通', '李谷', '孫鳳', '趙桓'], dtype=object)

In [10]:
df['客戶姓名'].duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
Name: 客戶姓名, dtype: bool

In [ ]:
df = pd.read_excel(r"..\data\銷售業績.xlsx")
df

In [ ]:
df1 = df.drop_duplicates(['日期']).drop(columns=['產品編號','產品名稱','單價','數量','小計','業務員','店名'])
df1.info()

In [ ]:
df2 = pd.DataFrame(pd.date_range(start='1/1/2014', end='12/31/2014'),columns=['日期'])
df2.info()

In [ ]:
df2 = pd.concat([df2,df1],axis=0)
df2 = pd.concat([df2,df1],axis=0)
df2.drop_duplicates(keep=False)  #  找出整年到底哪幾天沒有交易

In [ ]:
df1 = pd.DataFrame([['a', 10, '男'],
                 ['b', 11, '男'],
                 ['c', 11, '女'],
                 ['a', 10, '女'],
                 ['c', 11, '男']],
                columns=['name', 'age', 'sex'])

df2 = pd.DataFrame([['a', 10, '男'],
                 ['b', 11, '女']],
                columns=['name', 'age', 'sex'])

# df1.append(df2)   # Use pandas.concat instead.  差集
df1 = pd.concat([df1,df2],axis=0)
df1 = pd.concat([df1,df2],axis=0)
df1.drop_duplicates(keep=False)

In [ ]:
pd.merge(df1,df2,on=['name', 'age', 'sex'])  # 交集

In [ ]:
pd.merge(df1,df2,on=['name', 'age', 'sex'], how='outer')  #  聯集

In [ ]:
fruits1={'apple','banana','orange','lemon'}
fruits2={'tomato','apple','banana'}
print(fruits1 & fruits2)
print(fruits2 & fruits1)

#你也可以使用 intersection() 來取得交集，intersection() 用法範例如下，
nums1={1,2,3,4,5}
nums2={2,4,6,8,10}
print(nums1.intersection(nums2))
print(nums2.intersection(nums1))

In [ ]:
print(fruits1 | fruits2)
print(fruits2 | fruits1)

#你也可以使用 union() 來取得聯集，union() 用法範例如下，

print(nums1.union(nums2))
print(nums2.union(nums1))

In [ ]:
print(fruits1 - fruits2)
print(fruits2 - fruits1)

#你也可以使用 difference() 來取得差集，difference() 用法範例如下，
nums1={1,2,3,4,5}
nums2={4,5,6,7,8}
print(nums1.difference(nums2))
print(nums2.difference(nums1))

In [ ]:
# 對稱差集(symmetric difference)，
fruits1={'apple','banana','orange','lemon'}
fruits2={'tomato','apple','banana'}
print(fruits1 ^ fruits2)
print(fruits2 ^ fruits1)

#你也可以使用 symmetric_difference() 來取得對稱差集， symmetric_difference() 用法範例如下，
nums1={1,2,3,4,5}
nums2={4,5,6,7,8}
print(nums1.symmetric_difference(nums2))
print(nums2.symmetric_difference(nums1))

In [ ]:
s={1, 2, 3, 4, 5}
s.add(6)
s.add(7)
s.add(7)
print(s)

In [ ]:
df = pd.read_excel(r"..\data\銷售業績.xlsx")
df

In [ ]:
df['業務員'].unique()

## 異常值的檢測與處理
（本節無範例)

## 資料類型轉換
### 資料類型

In [11]:
df = pd.read_excel(r"..\data\test5.xlsx", sheet_name="5-4")
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
0   A1   張通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孫鳳    103 2018-08-10
3   A3   孫鳳    103 2018-08-10
4   A4   趙桓    104 2018-08-11
5   A5   趙桓    104 2018-08-12

In [12]:
df["訂單編號"].dtype #查看訂單編號這一欄的資料類型

dtype('O')

In [13]:
df["唯一識別碼"].dtype #查看唯一識別碼這一欄的資料類型

dtype('int64')

### 類型轉換

In [14]:
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
0   A1   張通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孫鳳    103 2018-08-10
3   A3   孫鳳    103 2018-08-10
4   A4   趙桓    104 2018-08-11
5   A5   趙桓    104 2018-08-12

In [15]:
df["唯一識別碼"].dtype #查看唯一識別碼這一列的資料類型

dtype('int64')

In [16]:
df["唯一識別碼"].astype("float64") #將唯一識別碼從int類型轉換為float類型

0    101.0
1    102.0
2    103.0
3    103.0
4    104.0
5    104.0
Name: 唯一識別碼, dtype: float64

## 索引設定
### 為無索引表添加索引

In [17]:
df = pd.read_excel("../data/test5.xlsx", sheet_name="5-5", header=None)
df

    0   1    2          3
0  A1  張通  101 2018-08-08
1  A2  李谷  102 2018-08-09
2  A3  孫鳳  103 2018-08-10
3  A3  孫鳳  103 2018-08-10
4  A4  趙桓  104 2018-08-11
5  A5  趙桓  104 2018-08-12

In [18]:
# 為表添加欄索引
df.columns = ["訂單編號","客戶姓名","唯一識別碼","成交時間"]
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
0   A1   張通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孫鳳    103 2018-08-10
3   A3   孫鳳    103 2018-08-10
4   A4   趙桓    104 2018-08-11
5   A5   趙桓    104 2018-08-12

In [19]:
#為表添加列索引
df.index = [1,2,3,4,5,6]
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
1   A1   張通    101 2018-08-08
2   A2   李谷    102 2018-08-09
3   A3   孫鳳    103 2018-08-10
4   A3   孫鳳    103 2018-08-10
5   A4   趙桓    104 2018-08-11
6   A5   趙桓    104 2018-08-12

### 重新設定索引

In [20]:
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
1   A1   張通    101 2018-08-08
2   A2   李谷    102 2018-08-09
3   A3   孫鳳    103 2018-08-10
4   A3   孫鳳    103 2018-08-10
5   A4   趙桓    104 2018-08-11
6   A5   趙桓    104 2018-08-12

In [21]:
df.set_index("訂單編號")

     客戶姓名  唯一識別碼       成交時間
訂單編號
A1     張通    101 2018-08-08
A2     李谷    102 2018-08-09
A3     孫鳳    103 2018-08-10
A3     孫鳳    103 2018-08-10
A4     趙桓    104 2018-08-11
A5     趙桓    104 2018-08-12

### 重新命名索引

In [29]:
df = pd.read_excel("../data/test5.xlsx", sheet_name="5-4")
df.index = [6,4,4,3,2,1]
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
6   A1   張通    101 2018-08-08
4   A2   李谷    102 2018-08-09
4   A3   孫鳳    103 2018-08-10
3   A3   孫鳳    103 2018-08-10
2   A4   趙桓    104 2018-08-11
1   A5   趙桓    104 2018-08-12

In [23]:
#重新命名欄索引
df.rename(columns = {"訂單編號":"新訂單編號", "客戶姓名":"新客戶姓名"})

  新訂單編號 新客戶姓名  唯一識別碼       成交時間
1    A1    張通    101 2018-08-08
2    A2    李谷    102 2018-08-09
3    A3    孫鳳    103 2018-08-10
4    A3    孫鳳    103 2018-08-10
5    A4    趙桓    104 2018-08-11
6    A5    趙桓    104 2018-08-12

In [24]:
#重新命名列索引
df.rename(index = {1:"一", 2:"二", 3:"三"})

  訂單編號 客戶姓名  唯一識別碼       成交時間
一   A1   張通    101 2018-08-08
二   A2   李谷    102 2018-08-09
三   A3   孫鳳    103 2018-08-10
4   A3   孫鳳    103 2018-08-10
5   A4   趙桓    104 2018-08-11
6   A5   趙桓    104 2018-08-12

In [25]:
#同時重新命名列索引和欄索引
df.rename(columns = {"訂單編號":"新訂單編號","客戶姓名":"新客戶姓名"},
            index = {1:"一",2:"二",3:"三"})

  新訂單編號 新客戶姓名  唯一識別碼       成交時間
一    A1    張通    101 2018-08-08
二    A2    李谷    102 2018-08-09
三    A3    孫鳳    103 2018-08-10
4    A3    孫鳳    103 2018-08-10
5    A4    趙桓    104 2018-08-11
6    A5    趙桓    104 2018-08-12

In [26]:
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
1   A1   張通    101 2018-08-08
2   A2   李谷    102 2018-08-09
3   A3   孫鳳    103 2018-08-10
4   A3   孫鳳    103 2018-08-10
5   A4   趙桓    104 2018-08-11
6   A5   趙桓    104 2018-08-12

### 重置索引

In [32]:
df = pd.DataFrame([[1,2],[3,4],[5,6],[7,8]], columns = ["C1","C2"], index = ["Z1","Z2","Z3","Z4"])
df

    C1  C2
Z1   1   2
Z2   3   4
Z3   5   6
Z4   7   8

In [33]:
df.reset_index(drop=True)

   C1  C2
0   1   2
1   3   4
2   5   6
3   7   8

In [34]:
df.T

    Z1  Z2  Z3  Z4
C1   1   3   5   7
C2   2   4   6   8

In [13]:
df = pd.read_excel("../data/test5.xlsx", sheet_name="5-5-4")
df = df.fillna(method="ffill")
names = (df.iloc[0,0],df.iloc[0,1])
df = df.drop(index=0)
arrays = [df['Unnamed: 0'],df['Unnamed: 1']]
df = df.drop(columns=['Unnamed: 0','Unnamed: 1'])
mti = pd.MultiIndex.from_arrays(arrays, names=names)
df.index=mti
df

        C1   C2
Z1 Z2
A  a   1.0  2.0
   b   3.0  4.0
B  a   5.0  6.0
   b   7.0  8.0

In [ ]:
arrays = [['A', 'A', 'B', 'B'], ['a', 'b', 'a', 'b']]
pd.MultiIndex.from_arrays(arrays, names=('Z1', 'Z1'))

In [36]:
df = pd.DataFrame({'c1':[1,3,5,7],'c2':[2,4,6,8]},
    index=pd.MultiIndex.from_tuples([('A','a'),('A','b'),('B','a'),('B','b')],names=['Z1', 'Z2']))

In [37]:
df

       c1  c2
Z1 Z2
A  a    1   2
   b    3   4
B  a    5   6
   b    7   8

In [7]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [9]:
df.fillna(method="bfill")

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  3.0 NaN  4.0
3  NaN  3.0 NaN  4.0